20240806T115522--kdoc-212-バイナリ博物館__draft_project.org
:properties:
:ID: 20240806T115522
:end:
#+title:      KDOC 212: バイナリ博物館
#+date:       [2024-08-06 Tue 11:55]
#+filetags:   :draft:project:
#+identifier: 20240806T115522

# (denote-rename-file-using-front-matter (buffer-file-name) 0)
# (save-excursion (while (re-search-backward ":draft" nil t) (replace-match "")))
# (flush-lines "^\\#\s.+?")

# ====ポリシー。
# 1ファイル1アイデア。
# 1ファイルで内容を完結させる。
# 常にほかのエントリとリンクする。
# 自分の言葉を使う。
# 参考文献を残しておく。
# 文献メモの場合は、感想と混ぜないこと。1つのアイデアに反する
# ツェッテルカステンの議論に寄与するか
# 頭のなかやツェッテルカステンにある問いとどのようにかかわっているか
# エントリ間の接続を発見したら、接続エントリを追加する。カード間にあるリンクの関係を説明するカード。
# アイデアがまとまったらアウトラインエントリを作成する。リンクをまとめたエントリ。
# エントリを削除しない。古いカードのどこが悪いかを説明する新しいカードへのリンクを追加する。
# 恐れずにカードを追加する。無意味の可能性があっても追加しておくことが重要。

# ====永久保存メモのルール。
# 自分の言葉で書く。
# 後から読み返して理解できる。
# 他のメモと関連付ける。
# ひとつのメモにひとつのことだけを書く。
# メモの内容は1枚で完結させる。
# 論文の中に組み込み、公表できるレベルである。

# ====価値があるか。
# その情報がどういった文脈で使えるか。
# どの程度重要な情報か。
# そのページのどこが本当に必要な部分なのか。

* この文書のステータス
- 作成
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))
- レビュー
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))

# 関連をつけた。
# タイトルがフォーマット通りにつけられている。
# 内容をブラウザに表示して読んだ(作成とレビューのチェックは同時にしない)。
# 文脈なく読めるのを確認した。
# おばあちゃんに説明できる。
# いらない見出しを削除した。
# タグを適切にした。
# すべてのコメントを削除した。
* 概要
# 本文(タイトルをつける)。
[[id:20240803T161124][KDOC 210: 『0と1のコンピュータ世界 バイナリで遊ぼう!』]]で紹介されていたバイナリかるたに興味を持って、自分でいろいろ見てみようと考えた。
* Tasks
** SQLiteファイル
.dbファイル。
** TLS通信のパケットキャプチャ
パケットキャプチャする。
** Git Object
大量のディレクトリになっているやつ。
** jar file
.jarファイル。
** TODO データ配置方法を決める

- 元のファイルにはアクセスしたい
- 記事は、シェルの実験とか残しやすいのでここでやるのが望ましい
- リポジトリサイズが肥大化するのを避けたい
- ファイルは別リポジトリにする。git submoduleを使ってリンクしやすいようにする
- バイナリ画像は必須だろう
- ファイル本体は、GitHub Pagesには含めないほうがいい
- ファイル本体は、できる限り小さくしなければならない。サイズを一覧できるようにする
- あまりでかすぎると、GitHub Pagesに入らなくなる可能性がある
- roam本体に影響するのは好ましくない
- 貼らないといけない画像は、単純にGitHubへのリンクにするのがありだな。

* 関連
# 関連するエントリ。なぜ関連させたか理由を書く。意味のあるつながりを意識的につくる。
# この事実は自分のこのアイデアとどう整合するか。
# この現象はあの理論でどう説明できるか。
# ふたつのアイデアは互いに矛盾するか、互いを補っているか。
# いま聞いた内容は以前に聞いたことがなかったか。
# メモ y についてメモ x はどういう意味か。
