20240806T115522--kdoc-212-バイナリ博物館__draft_project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-08 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 212: バイナリ博物館</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 212: バイナリ博物館</h1>

<div id="outline-container-org3f60de6" class="outline-2">
<h2 id="org3f60de6"><a href="#org3f60de6">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org3f60de6">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8d0a361" class="outline-2">
<h2 id="org8d0a361"><a href="#org8d0a361">概要</a></h2>
<div class="outline-text-2" id="text-org8d0a361">
<p>
<a href="20240803T161124--kdoc-210-『0と1のコンピュータ世界-バイナリで遊ぼう』__draft_book.html#ID-20240803T161124">KDOC 210: 『0と1のコンピュータ世界 バイナリで遊ぼう!』</a>で紹介されていたバイナリかるたに興味を持って、自分でいろいろ見てみようと考えた。
</p>
</div>
</div>
<div id="outline-container-org0d66998" class="outline-2">
<h2 id="org0d66998"><a href="#org0d66998">Tasks</a></h2>
<div class="outline-text-2" id="text-org0d66998">
</div>
<div id="outline-container-orgbb5b23c" class="outline-3">
<h3 id="orgbb5b23c"><a href="#orgbb5b23c">SQLiteファイル</a></h3>
<div class="outline-text-3" id="text-orgbb5b23c">
<p>
.dbファイル。
</p>
</div>
</div>
<div id="outline-container-org2431c93" class="outline-3">
<h3 id="org2431c93"><a href="#org2431c93">TLS通信のパケットキャプチャ</a></h3>
<div class="outline-text-3" id="text-org2431c93">
<p>
パケットキャプチャする。
</p>
</div>
</div>
<div id="outline-container-org1e2c5f3" class="outline-3">
<h3 id="org1e2c5f3"><a href="#org1e2c5f3">Git Object</a></h3>
<div class="outline-text-3" id="text-org1e2c5f3">
<p>
大量のディレクトリになっているやつ。
</p>
</div>
</div>
<div id="outline-container-org69ea62a" class="outline-3">
<h3 id="org69ea62a"><a href="#org69ea62a">jar file</a></h3>
<div class="outline-text-3" id="text-org69ea62a">
<p>
.jarファイル。
</p>
</div>
</div>
<div id="outline-container-org2bec6d3" class="outline-3">
<h3 id="org2bec6d3"><a href="#org2bec6d3"><span class="todo TODO">TODO</span> データ配置方法を決める</a></h3>
<div class="outline-text-3" id="text-org2bec6d3">
<ul class="org-ul">
<li>元のファイルにはアクセスしたい</li>
<li>記事は、シェルの実験とか残しやすいのでここでやるのが望ましい</li>
<li>リポジトリサイズが肥大化するのを避けたい</li>
<li>ファイルは別リポジトリにする。git submoduleを使ってリンクしやすいようにする</li>
<li>バイナリ画像は必須だろう</li>
<li>ファイル本体は、GitHub Pagesには含めないほうがいい</li>
<li>ファイル本体は、できる限り小さくしなければならない。サイズを一覧できるようにする</li>
<li>あまりでかすぎると、GitHub Pagesに入らなくなる可能性がある</li>
<li>roam本体に影響するのは好ましくない</li>
<li>貼らないといけない画像は、単純にGitHubへのリンクにするのがありだな。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org641964b" class="outline-2">
<h2 id="org641964b"><a href="#org641964b">関連</a></h2>
<div class="outline-text-2" id="text-org641964b">
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
